app/controllers/authors_controller.rb

INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Sandi Metz"], ["created_at", "2016-07-07 12:33:05.176064"], ["updated_at", "2016-07-07 12:33:05.176064"]]
---
  def create
    #grab submitted form values
    @author = Author.new(author_params)
    if @author.save