app/controllers/books_controller.rb

  def index
    # author_books_path GET    /authors/:author_id/books(.:format)          books#index
    @authors = Author.all
    @books  = Book.all
---
SELECT "authors".* FROM "authors"
SELECT "books".* FROM "books"

  def update
    @book = Book.find(params[:id])
    @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", nil]]
UPDATE "books" SET "subtitle" = $1, "img_url" = $2, "updated_at" = $3 WHERE "books"."id" = $4  [["subtitle", "Learn Web Development With Rails"], ["img_url", "ror-tutorial.jpg"], ["updated_at", "2016-07-07 18:27:17.826294"], ["id", 17]]

  def create
    # @book = Book.find(params[:id])
    @book = Book.create!(book_params)
---
INSERT INTO "books" ("title", "subtitle", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "ewufgquefgu"], ["subtitle", "ugvaudvgaui"], ["created_at", "2016-07-06 12:30:39.724951"], ["updated_at", "2016-07-06 12:30:39.724951"]]